
const ReadingOrTranslation = () => {
  return (
    <div className="singleSurahDetails col-span-12 lg:col-span-8 text-center min-h-screen mt-5">
      <div className="mt-4">
        <h3 className="text-3xl">سُورَةُ آلِ عِمۡرَانَ</h3>
      </div>
      <div className="mt-5">
        <h4 className="text-2xl">بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ</h4>
      </div>
      <div className="mt-5 text-2xl leading-10 px-20">
        <p className="">
          وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ لِمَ تُؤۡذُوۡنَنِىۡ وَقَد
          تَّعۡلَمُوۡنَ اَنِّىۡ رَسُوۡلُ اللّٰهِ اِلَيۡكُمۡؕ فَلَمَّا زَاغُوۡۤا
          اَزَاغَ اللّٰهُ قُلُوۡبَهُمۡ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ
          الۡفٰسِقِيۡنَ‏ ٥ وَاِذۡ قَالَ عِيۡسَى ابۡنُ مَرۡيَمَ يٰبَنِىۡۤ
          اِسۡرَآءِيۡلَ اِنِّىۡ رَسُوۡلُ اللّٰهِ اِلَيۡكُمۡ مُّصَدِّقًا لِّمَا
          بَيۡنَ يَدَىَّ مِنَ التَّوۡرٰٮةِ وَمُبَشِّرًۢا بِرَسُوۡلٍ يَّاۡتِىۡ
          مِنۡۢ بَعۡدِى اسۡمُهٗۤ اَحۡمَدُ​ؕ فَلَمَّا جَآءَهُمۡ بِالۡبَيِّنٰتِ
          قَالُوۡا هٰذَا سِحۡرٌ مُّبِيۡنٌ‏ ٦ وَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَـرٰى
          عَلَى اللّٰهِ الۡكَذِبَ وَهُوَ يُدۡعٰٓى اِلَى الۡاِسۡلَامِ​ ؕ
          وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ‏ ٧ يُرِيۡدُوۡنَ
          لِيُطۡفِــُٔـوۡا نُوۡرَ اللّٰهِ بِاَ فۡوَاهِهِمْ وَاللّٰهُ مُتِمُّ
          نُوۡرِهٖ وَلَوۡ كَرِهَ الۡكٰفِرُوۡنَ‏ ٨ هُوَ الَّذِىۡۤ اَرۡسَلَ
          رَسُوۡلَهٗ بِالۡهُدٰى وَدِيۡنِ الۡحَـقِّ لِيُظۡهِرَهٗ عَلَى الدِّيۡنِ
          كُلِّهٖ وَلَوۡ كَرِهَ الۡمُشۡرِكُوۡنَ‏ ٩ يٰۤاَيُّهَا الَّذِيۡنَ
          اٰمَنُوۡا هَلۡ اَدُلُّكُمۡ عَلٰى تِجَارَةٍ تُنۡجِيۡكُمۡ مِّنۡ عَذَابٍ
          اَلِيۡمٍ‏ ١٠ تُؤۡمِنُوۡنَ بِاللّٰهِ وَرَسُوۡلِهٖ وَتُجَاهِدُوۡنَ فِىۡ
          سَبِيۡلِ اللّٰهِ بِاَمۡوَالِكُمۡ وَاَنۡفُسِكُمۡ​ؕ ذٰلِكُمۡ خَيۡرٌ
          لَّـكُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَۙ‏ ﻿﻿ ١١
        </p>
      </div>
    </div>
  );
};

export default ReadingOrTranslation;
